app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    @user.save do |result|
---
INSERT INTO "users" ("last_request_at", "created_at", "crypted_password", "updated_at", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "login", "last_login_at") VALUES('2010-04-01 19:52:03', '2010-04-01 19:52:03', 'a4b25c1ff00f479e1c39fb164d4354050931c08bf7aec9a6378f2f43797b9051d87dacc5aeb1067bb46e598b54bef59f37d4e83ba02679d353432b2f07c48f3c', '2010-04-01 19:52:03', '127.0.0.1', 'RA_md1Hvb1vd_57Zb2Wk', '2010-04-01 19:52:03', 'b7b60c4ba3b8af0bd6d79cb1834c2d07f0cd196cf867f8698117803a973f3f0e84f27e2bb48b94ec08c0547cce93ac8e69564719a455cd505d8659d251582348', 1, NULL, 'admin', NULL)